<template>
    <div class="frequently-questions">
        <div class="frequently-questions-title">
            <h4>Часто задаваемые вопросы</h4>
        </div>
        <div class="questions-content">
            <Qustion :title="'Требуется ли постоянная плата за поддержку сайта ?'" :answer="asnwer"/>
            <Qustion :title="'Требуется ли постоянная плата за поддержку сайта ?'" :answer="asnwer" />
            <Qustion :title="'Могу ли я подарить цифровые мемориалы Our Tributes родственникам или друзьям?'"
                :answer="asnwer" />
            <Qustion :title="'Можно ли использовать одну страницу для двух человек, например, для пары?'"
                :answer="asnwer" />
            <Qustion :title="'Может ли табличка повредить надгробие? Что делать, если мне придётся её снять позже?'"
                :answer="asnwer" />
        </div>
    </div>
</template>



<script setup>
import { ref } from 'vue'
import Qustion from '@/components/g/Question.vue'

const asnwer = ref('Нет! Стремясь к доступности, мы предлагаем разовую покупку персонализируемой мемориальной веб-страницы «Наши воспоминания». Эта услуга включает пожизненное хранение до 50 фотографий, неограниченного количества видео и текста для вашей онлайн-памяти. Для тех, кто хочет добавить больше воспоминаний, доступно дополнительное хранилище фотографий по годовой подписке, что позволяет поддерживать полноту и актуальность цифрового мемориала вашего близкого.')
</script>